//HELLOJOB JOB CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//*
//COMPILE  EXEC PGM=IGYCRCTL
//SYSIN    DD DSN=USERID.SOURCE(HELLO),DISP=SHR
//SYSLIN   DD DSN=&&LOADSET,DISP=(MOD,PASS)
//SYSPRINT DD SYSOUT=*
//*
//LKED     EXEC PGM=IEWL,PARM='MAP'
//SYSLIN   DD DSN=&&LOADSET,DISP=(OLD,DELETE)
//SYSLMOD  DD DSN=USERID.LOADLIB(HELLO),DISP=SHR
//SYSPRINT DD SYSOUT=*
//*
//RUN      EXEC PGM=HELLO
//STEPLIB  DD DSN=USERID.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//
