       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MESSAGE PIC X(30)
          VALUE 'HELLO WORLD FROM ANSIBLE'.

       PROCEDURE DIVISION.
           DISPLAY WS-MESSAGE
           GOBACK.
